TUT18/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    dymWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    
    outlet1
    {
        type            calculated;
        value           uniform 0;
    }
    
    outlet2
    {
        type            calculated;
        value           uniform 0;
    }
    
    walls
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    AMI1
    {
        type            cyclicAMI;
        value           $internalField;
    }

    AMI2
    {
        type            cyclicAMI;
        value           $internalField;
    }
    
    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
        
}


// ************************************************************************* //
